server/tests/load/test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 120                 
      arrivalRate: 100               
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:  
  - name: "GET Cases"
    flow:
      - get:
          url: "/api/cases"

  - name: "GET Case Order by ID"
    flow:
      - get:
          url: "/api/orders/1"

  - name: "POST create case order"
    flow:
      - post:
          url: "/api/orders"
          json:
            quantity: 1000
          expect:
            - statusCode: 201
      - think: 2